# SQL #3 - SubQuery
Before start this notebook, please make sure to complete this following list:
- Install [XAMPP](https://www.apachefriends.org/index.html)
- Start MySQL Database, and Apache Webserver
- Install Package `SQLAlchemy` on notebook, this package is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL
- Import database `mysqlsampledatabase.sql` to MySQL Database

## Connect to database
Connect to localhost, using `classicmodels` database with default user.

In [31]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine

host = 'localhost'
port = "3306"
user = 'root'
password = ''
database = 'classicmodels'

#create connection to database
engine = create_engine('mysql+pymysql://'+user+':'+password+'@'+host+':'+port+'/'+database)
# engine = create_engine('mysql+pymysql://root: @localhost:3306/classicmodels)

def run(sql):
    df = pd.read_sql_query(sql,engine)
    return df

## Input CSV to MySQL
- Open `student.csv` file, see the structure of that file which contains `ID, Name` in their header.
- Read Data from `studen.csv` file
- input csv to SQL database

In [32]:
#CSV to DataFrame to MySQL
df_fromcsv = pd.read_csv('student.csv')
df_fromcsv.to_sql(name = 'student', con = engine, if_exists = 'replace', index = False)
# if_exists = 'fail' | 'replace' | 'append'

In [33]:
df_result = run("SELECT * FROM student")
print(df_result)

   ID    Name
0  11     Ani
1  22    Budi
2  33   Citra
3  44   Damar
4  55    Esti

## Add data using Query INSERT
Insert will be autocommit

In [34]:
engine.execute("INSERT INTO student VALUES(66,'Fajar')")

In [35]:
run("SELECT * FROM student")

   ID    Name
0  11     Ani
1  22    Budi
2  33   Citra
3  44   Damar
4  55    Esti
5  66   Fajar